export const codingData = [
    // --- СИСТЕМА КРОВООБІГУ (K) ---
    { name: "Гіпертонічна хвороба", mkx: "I10", icpc: "K86" },
    { name: "Стенокардія", mkx: "I20", icpc: "K74" },
    { name: "Гострий інфаркт міокарда", mkx: "I21", icpc: "K75" },
    { name: "Хронічна ішемічна хвороба серця", mkx: "I25", icpc: "K76" },
    { name: "Легенева емболія (ТЕЛА)", mkx: "I26", icpc: "K82" },
    { name: "Пароксизмальна тахікардія", mkx: "I47", icpc: "K79" },
    { name: "Фібриляція та тріпотіння передсердь", mkx: "I48", icpc: "K80" },
    { name: "Серцева недостатність", mkx: "I50", icpc: "K77" },
    { name: "Інсульт, не уточнений як крововилив чи інфаркт", mkx: "I64", icpc: "K90" },
    { name: "Варикозне розширення вен нижніх кінцівок", mkx: "I83", icpc: "K95" },

    // --- ДИХАЛЬНА СИСТЕМА (R) ---
    { name: "Гостра інфекція верхніх дихальних шляхів (ГРВІ)", mkx: "J06", icpc: "R74" },
    { name: "Гострий ларингіт та трахеїт", mkx: "J04", icpc: "R77" },
    { name: "Пневмонія", mkx: "J18", icpc: "R81" },
    { name: "Гострий бронхіт", mkx: "J20", icpc: "R78" },
    { name: "Хронічне обструктивне захворювання легень (ХОЗЛ)", mkx: "J44", icpc: "R95" },
    { name: "Бронхіальна астма", mkx: "J45", icpc: "R96" },
    { name: "Кашель", mkx: "R05", icpc: "R05" },

    // --- ТРАВНИЙ ТРАКТ (D) ---
    { name: "Гастроентерит та коліт інфекційного походження", mkx: "A09", icpc: "D73" },
    { name: "Виразка шлунка / дванадцятипалої кишки", mkx: "K27", icpc: "D87" },
    { name: "Гострий апендицит", mkx: "K35", icpc: "D88" },
    { name: "Жовчнокам'яна хвороба (холелітіаз)", mkx: "K80", icpc: "D97" },
    { name: "Гострий панкреатит", mkx: "K85", icpc: "D99" },
    { name: "Неінфекційний хр. ентероколіт", mkx: "K52.9", icpc: "D99" },

    // --- НЕВРОЛОГІЯ ТА ПСИХІАТРІЯ (N, P) ---
    { name: "Транзиторна ішемічна атака", mkx: "G45", icpc: "K89" },
    { name: "Епілепсія", mkx: "G40", icpc: "N88" },
    { name: "Мігрень", mkx: "G43", icpc: "N89" },
    { name: "Гострий стрес (реакція)", mkx: "F43.0", icpc: "P02" },
    { name: "Деменція", mkx: "F03", icpc: "P70" },

    // --- ЕНДОКРИНОЛОГІЯ ТА ЗАГАЛЬНІ (T, A) ---
    { name: "Цукровий діабет 2 типу", mkx: "E11", icpc: "T90" },
    { name: "Анафілактичний шок", mkx: "T78.2", icpc: "A92" },
    { name: "Гарячка (Лихоманка)", mkx: "R50", icpc: "A03" },
    { name: "Біль загальний", mkx: "R52", icpc: "A01" },

    // --- ТРАВМИ ТА ОТРУЄННЯ (S, A) ---
    { name: "Струс головного мозку", mkx: "S06.0", icpc: "N79" },
    { name: "Перелом гомілки", mkx: "S82", icpc: "L76" },
    { name: "Перелом передпліччя", mkx: "S52", icpc: "L72" },
    { name: "Опік термічний", mkx: "T30", icpc: "S14" },
    { name: "Отруєння лікарськими засобами", mkx: "T50", icpc: "A84" }
];
